{
	"format": "layers-model",
	"generatedBy": "keras v2.4.0",
	"convertedBy": "TensorFlow.js Converter v2.6.0",
	"modelTopology": {
		"keras_version": "2.4.0",
		"backend": "tensorflow",
		"model_config": {
			"class_name": "Model",
			"config": {
				"name": "functional_1",
				"layers": [
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [
								null,
								150
							],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "b1_input"
						},
						"name": "b1_input",
						"inbound_nodes": []
					},
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [
								null,
								150
							],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "b2_input"
						},
						"name": "b2_input",
						"inbound_nodes": []
					},
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [
								null,
								150
							],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "b3_input"
						},
						"name": "b3_input",
						"inbound_nodes": []
					},
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [
								null,
								150
							],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "b4_input"
						},
						"name": "b4_input",
						"inbound_nodes": []
					},
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [
								null,
								150
							],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "b5_input"
						},
						"name": "b5_input",
						"inbound_nodes": []
					},
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [
								null,
								150
							],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "r1_input"
						},
						"name": "r1_input",
						"inbound_nodes": []
					},
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [
								null,
								150
							],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "r2_input"
						},
						"name": "r2_input",
						"inbound_nodes": []
					},
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [
								null,
								150
							],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "r3_input"
						},
						"name": "r3_input",
						"inbound_nodes": []
					},
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [
								null,
								150
							],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "r4_input"
						},
						"name": "r4_input",
						"inbound_nodes": []
					},
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [
								null,
								150
							],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "r5_input"
						},
						"name": "r5_input",
						"inbound_nodes": []
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense",
							"trainable": true,
							"dtype": "float32",
							"units": 5,
							"activation": "relu",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "GlorotUniform",
								"config": {
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "dense",
						"inbound_nodes": [
							[
								[
									"b1_input",
									0,
									0,
									{}
								]
							],
							[
								[
									"b2_input",
									0,
									0,
									{}
								]
							],
							[
								[
									"b3_input",
									0,
									0,
									{}
								]
							],
							[
								[
									"b4_input",
									0,
									0,
									{}
								]
							],
							[
								[
									"b5_input",
									0,
									0,
									{}
								]
							],
							[
								[
									"r1_input",
									0,
									0,
									{}
								]
							],
							[
								[
									"r2_input",
									0,
									0,
									{}
								]
							],
							[
								[
									"r3_input",
									0,
									0,
									{}
								]
							],
							[
								[
									"r4_input",
									0,
									0,
									{}
								]
							],
							[
								[
									"r5_input",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Concatenate",
						"config": {
							"name": "concatenate",
							"trainable": true,
							"dtype": "float32",
							"axis": -1
						},
						"name": "concatenate",
						"inbound_nodes": [
							[
								[
									"dense",
									0,
									0,
									{}
								],
								[
									"dense",
									1,
									0,
									{}
								],
								[
									"dense",
									2,
									0,
									{}
								],
								[
									"dense",
									3,
									0,
									{}
								],
								[
									"dense",
									4,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Concatenate",
						"config": {
							"name": "concatenate_1",
							"trainable": true,
							"dtype": "float32",
							"axis": -1
						},
						"name": "concatenate_1",
						"inbound_nodes": [
							[
								[
									"dense",
									5,
									0,
									{}
								],
								[
									"dense",
									6,
									0,
									{}
								],
								[
									"dense",
									7,
									0,
									{}
								],
								[
									"dense",
									8,
									0,
									{}
								],
								[
									"dense",
									9,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_1",
							"trainable": true,
							"dtype": "float32",
							"units": 15,
							"activation": "relu",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "GlorotUniform",
								"config": {
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "dense_1",
						"inbound_nodes": [
							[
								[
									"concatenate",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_2",
							"trainable": true,
							"dtype": "float32",
							"units": 15,
							"activation": "relu",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "GlorotUniform",
								"config": {
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "dense_2",
						"inbound_nodes": [
							[
								[
									"concatenate_1",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Concatenate",
						"config": {
							"name": "concatenate_2",
							"trainable": true,
							"dtype": "float32",
							"axis": -1
						},
						"name": "concatenate_2",
						"inbound_nodes": [
							[
								[
									"dense_1",
									0,
									0,
									{}
								],
								[
									"dense_2",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_3",
							"trainable": true,
							"dtype": "float32",
							"units": 1,
							"activation": "sigmoid",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "GlorotUniform",
								"config": {
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "dense_3",
						"inbound_nodes": [
							[
								[
									"concatenate_2",
									0,
									0,
									{}
								]
							]
						]
					}
				],
				"input_layers": [
					[
						"b1_input",
						0,
						0
					],
					[
						"b2_input",
						0,
						0
					],
					[
						"b3_input",
						0,
						0
					],
					[
						"b4_input",
						0,
						0
					],
					[
						"b5_input",
						0,
						0
					],
					[
						"r1_input",
						0,
						0
					],
					[
						"r2_input",
						0,
						0
					],
					[
						"r3_input",
						0,
						0
					],
					[
						"r4_input",
						0,
						0
					],
					[
						"r5_input",
						0,
						0
					]
				],
				"output_layers": [
					[
						"dense_3",
						0,
						0
					]
				]
			}
		},
		"training_config": {
			"loss": "binary_crossentropy",
			"metrics": [
				"binary_accuracy"
			],
			"weighted_metrics": null,
			"loss_weights": null,
			"optimizer_config": {
				"class_name": "Adam",
				"config": {
					"name": "Adam",
					"learning_rate": 0.0010000000474974513,
					"decay": 0.0,
					"beta_1": 0.8999999761581421,
					"beta_2": 0.9990000128746033,
					"epsilon": 1e-07,
					"amsgrad": false
				}
			}
		}
	},
	"weightsManifest": [
		{
			"paths": [
				"group1-shard1of1.bin"
			],
			"weights": [
				{
					"name": "dense/kernel",
					"shape": [
						150,
						5
					],
					"dtype": "float32"
				},
				{
					"name": "dense/bias",
					"shape": [
						5
					],
					"dtype": "float32"
				},
				{
					"name": "dense_1/kernel",
					"shape": [
						25,
						15
					],
					"dtype": "float32"
				},
				{
					"name": "dense_1/bias",
					"shape": [
						15
					],
					"dtype": "float32"
				},
				{
					"name": "dense_2/kernel",
					"shape": [
						25,
						15
					],
					"dtype": "float32"
				},
				{
					"name": "dense_2/bias",
					"shape": [
						15
					],
					"dtype": "float32"
				},
				{
					"name": "dense_3/kernel",
					"shape": [
						30,
						1
					],
					"dtype": "float32"
				},
				{
					"name": "dense_3/bias",
					"shape": [
						1
					],
					"dtype": "float32"
				}
			]
		}
	]
}